function getData (key) {
	return data[key];
}

function getChunGuaData (key) {
	return chunGua[key];
}

function get64Data() {
	return data;
}

function getGuaGong(data)
{
	if(data[3] != '八纯卦')
	{
		return data[4];
	}
	return ""
}

function getGuaGongWuXin(data)
{
	if(data[3] != '八纯卦')
	{
		return wuxing[chuGuaWuXin[data[4]][0]];
	}
	else
	{
		return wuxing[data[4]];
	}
}

function getFuYao(data)
{
	if(data[3] != '八纯卦')
	{
		return chuGuaWuXin[data[4]][1];
	}
	else
	{
		return ['','','','','',''];
	}
}

function getZhuGuaNajia(userArr)
{
	let waigua = userArr.substring(0,3);
	let neigua = userArr.substring(3);
	let neichungua = neigua + neigua;
	let waichungua = waigua + waigua;
	
	waichungua = waichungua.replace(/2/g,'0');
	waichungua = waichungua.replace(/3/g,'1');
	neichungua = neichungua.replace(/3/g,'1');
	neichungua = neichungua.replace(/2/g,'0');
	
	let targetNeiChunGua = this.getChunGuaData(neichungua);
	let targetWaiChunGua = this.getChunGuaData(waichungua);
	
	let orderChunGua = waichungua + neichungua;
	
	let najia = []
	najia[0] = targetWaiChunGua[2][0];
	najia[1] = targetWaiChunGua[2][1];
	najia[2] = targetWaiChunGua[2][2];
	najia[3] = targetNeiChunGua[2][3];
	najia[4] = targetNeiChunGua[2][4];
	najia[5] = targetNeiChunGua[2][5];
	
	return najia;
}

function getZhuGuaData(userArr)
{	
	userArr = userArr.replace(/2/g,'0');
	userArr = userArr.replace(/3/g,'1');
	return userArr;
}


function getBianGuaData(userArr)
{	
	userArr = userArr.replace(/2/g,'1');
	userArr = userArr.replace(/3/g,'0');		
	return userArr;
}


function getBianGuaNajia(userArr)
{
	let waigua = userArr.substring(0,3);
	let neigua = userArr.substring(3);
	let neichungua = neigua + neigua;
	let waichungua = waigua + waigua;
	
	waichungua = waichungua.replace(/2/g,'1');
	waichungua = waichungua.replace(/3/g,'0');
	neichungua = neichungua.replace(/3/g,'0');
	neichungua = neichungua.replace(/2/g,'1');
	
	let targetNeiChunGua = this.getChunGuaData(neichungua);
	let targetWaiChunGua = this.getChunGuaData(waichungua);
	
	let orderChunGua = waichungua + neichungua;
	
	let najia = []
	najia[0] = targetWaiChunGua[2][0];
	najia[1] = targetWaiChunGua[2][1];
	najia[2] = targetWaiChunGua[2][2];
	najia[3] = targetNeiChunGua[2][3];
	najia[4] = targetNeiChunGua[2][4];
	najia[5] = targetNeiChunGua[2][5];
	
	return najia;
}
let jiaZiWuxin = 
{
	'子':['水',2],
	'丑':['土',4],
	'寅':['木',1],
	'卯':['木',1],
	'辰':['土',4],
	'巳':['火',3],
	'午':['火',3],
	'未':['土',4],
	'申':['金',0],
	'酉':['金',0],
	'戌':['土',4],
	'亥':['水',2]
}

let wuxing = {
    //金、木、水、火、土
	'金':['兄弟','妻财','子孙','官鬼','父母'],
	'木':['官鬼','兄弟','父母','子孙','妻财'],
	'水':['父母','子孙','兄弟','妻财','官鬼'],
	'火':['妻财','父母','官鬼','兄弟','子孙'],
	'土':['父母','官鬼','妻财','父母','兄弟'],
}


let chunGua = {
	'111111':['乾为天',"金",['壬戌土','壬申金','壬午火','甲辰土','甲寅木','甲子水']],
	'000000':['坤为地',"土",['癸酉金','癸亥水','癸丑土','乙卯木','乙巳火','乙未土']],
	'101101':['离为火',"火",['己巳火','己未土','己酉金','己亥水','己丑土','己卯木']],
	'010010':['坎为水',"水",['戊子水','戊戌土','戊申金','戊午火','戊辰土','戊寅木']],
	'100100':['艮为山',"土",['丙寅木','丙子水','丙戌土','丙申金','丙午火','丙辰土']],
	'011011':['兑为泽',"金",['丁未土','丁酉金','丁亥水','丁丑土','丁卯木','丁巳火']],
	'110110':['巽为风',"木",['辛卯木','辛巳火','辛未士','辛酉金','辛亥水','辛丑土']],
	'001001':['震为雷',"木",['庚戌土','庚申金','庚午火','庚辰土','庚寅木','庚子水']],
};

let chuGuaWuXin = 
{
	'乾':['金',['壬戌土','壬申金','壬午火','甲辰土','甲寅木','甲子水']],
	'坤':['土',['癸酉金','癸亥水','癸丑土','乙卯木','乙巳火','乙未土']],
	'坎':['水',['戊子水','戊戌土','戊申金','戊午火','戊辰土','戊寅木']],
	'离':['火',['己巳火','己未土','己酉金','己亥水','己丑土','己卯木']],
	'震':['木',['庚戌土','庚申金','庚午火','庚辰土','庚寅木','庚子水']],
	'艮':['土',['丙寅木','丙子水','丙戌土','丙申金','丙午火','丙辰土']],
	'巽':['木',['辛卯木','辛巳火','辛未士','辛酉金','辛亥水','辛丑土']],
	'兑':['金',['丁未土','丁酉金','丁亥水','丁丑土','丁卯木','丁巳火']]
}

let data = {
	  '111111': ['1', '乾为天','乾', '八纯卦','金','111111'],
	  '000000': ['2', '坤为地','坤', '八纯卦','土','000000'],
	  '010001': ['3', '水雷屯','屯', '二世卦','坎','010001'],
	  '100010': ['4', '山水蒙','蒙', '四世卦','离','100010'],
	  '010111': ['5', '水天需','需', '游魂卦','坤','010111'],
	  '111010': ['6', '天水讼','讼', '游魂卦','离','111010'],			  
	  '000010': ['7', '地水师','师', '归魂卦','坎','000010'],
	  '010000': ['8', '水地比','比', '归魂卦','坤','010000'],
	  '110111': ['9', '风天小畜','小畜','一世卦','巽','110111'],
	  '111011': ['10', '天泽履','履','五世卦','艮','111011'],
	  '000111': ['11', '地天泰','泰','三世卦','坤','000111'],
	  '111000': ['12', '天地否','否','三世卦','乾','111000'],
	  '111101': ['13', '天火同人','同人','归魂卦','离','111101'],
	  '101111': ['14', '火天大有','大有','归魂卦','乾','101111'],
	  '000100': ['15', '地山谦','谦','五世卦','兑','000100'],
	  '001000': ['16', '雷地豫','豫','一世卦','震','001000'],
	  '011001': ['17', '泽雷随','随','归魂卦','震','011001'],
	  '100110': ['18', '山风蛊','蛊','归魂卦','巽','100110'],
	  '000011': ['19', '地泽临','临', '二世卦','坤','000011'],
	  '110000': ['20', '风地观','观','四世卦','乾','110000'],
	  '101001': ['21', '火雷噬嗑','噬嗑','五世卦','巽','101001'],
	  '100101': ['22', '山火贲','贲', '一世卦','艮','100101'],
	  '100000': ['23', '山地剥','剥', '五世卦','乾','100000'],
	  '000001': ['24', '地雷复','复','一世卦','坤','000001'],
	  '111001': ['25', '天雷无妄','无妄','四世卦','巽','111001'],
	  '100111': ['26', '山天大畜','大畜', '二世卦','艮','100111'],
	  '100001': ['27', '山雷颐','颐', '游魂卦','巽','100001'],
	  '011110': ['28', '泽风大过','大过','游魂卦','震','011110'],
	  '010010': ['29', '坎为水','坎','八纯卦','水','010010'],
	  '101101': ['30', '离为火','离','八纯卦','火','101101'],            
	  '011100': ['31', '泽山咸','咸','三世卦','兑','011100'],             
	  '001110': ['32', '雷风恒','恒','三世卦','震','001110'],
	  '111100': ['33', '天山遁','遁','二世卦','乾','111100'],
	  '001111': ['34', '雷天大壮','大壮','四世卦','坤','001111'],
	  '101000': ['35', '火地晋','晋','游魂卦','乾','101000'],
	  '000101': ['36', '地火明夷','明夷', '游魂卦','坎','000101'],
	  '110101': ['37', '风火家人','家人', '二世卦','巽','110101'],
	  '101011': ['38', '火泽睽','睽','四世卦','艮','101011'],
	  '010100': ['39', '水山蹇','蹇','四世卦','兑','010100'],
	  '001010': ['40', '雷水解','解','二世卦','震','001010'],
	  '100011': ['41', '山泽损','损','三世卦','艮','100011'],
	  '110001': ['42', '风雷益','益','三世卦','巽','110001'],
	  '011111': ['43', '泽天夬','夬','五世卦','坤','011111'],
	  '111110': ['44', '风天姤','姤','一世卦','乾','111110'],
	  '011000': ['45', '泽地萃','萃','二世卦','兑','011000'],
	  '000110': ['46', '地风升','升','四世卦','震','000110'],
	  '011010': ['47', '泽水困','困','一世卦','兑','011010'],
	  '010110': ['48', '水风井','井','五世卦','震','010110'],
	  '011101': ['49', '泽火革','革','四世卦','坎','011101'],
	  '101110': ['50', '火风鼎','鼎','二世卦','离','101110'],
	  '001001': ['51', '震为雷','震','八纯卦','木','001001'],
	  '100100': ['52', '艮为山','艮','八纯卦','土','100100'],
	  '110100': ['53', '风山渐','渐','归魂卦','艮','110100'],
	  '001011': ['54', '雷泽归妹','归妹','归魂卦','兑','001011'],
	  '001101': ['55', '雷火丰','丰','五世卦','坎','001101'],
	  '101100': ['56', '火山旅','旅','一世卦','离','101100'],
	  '110110': ['57', '巽为风','巽','八纯卦','木','110110'],
	  '011011': ['58', '兑为泽','兑', '八纯卦','金','011011'],
	  '110010': ['59', '风水涣','涣', '五世卦','离','110010'],
	  '010011': ['60', '水泽节','节', '一世卦','坎','010011'],
	  '110011': ['61', '风泽中孚','中孚', '游魂卦','艮','110011'],
	  '001100': ['62', '雷山小过','小过','游魂卦','兑','001100'],
	  '010101': ['63', '水火既济','既济','三世卦','坎','010101'],
	  '101010': ['64', '火水未济','未济', '三世卦','离','101010']
}

function getWuXingIndex(dizhi)
{
	return  jiaZiWuxin[dizhi]
}

function getShiYing(zhushiyin)
{
	let data = [];
	if(zhushiyin == '一世卦')
	{
		data=['','','应','','','世']
	}else if(zhushiyin == '二世卦')
	{
		data=['','应','','','世','']
	}else if(zhushiyin == '三世卦'|| zhushiyin == '游魂卦')
	{
		data=['应','','','世','','']
	}else if(zhushiyin == '四世卦'|| zhushiyin == '归魂卦')
	{
		data=['','','世','','','应']
	}else if(zhushiyin == '五世卦')
	{
		data=['','世','','','应','']
	}
	else if(zhushiyin == '八纯卦')
	{
		data=['世','','','应','','']
	}
	return  data;
}

export default {
  getData,
  getChunGuaData,
  getBianGuaNajia,
  getZhuGuaNajia,
  getZhuGuaData,
  getBianGuaData,
  get64Data,
  getShiYing,
  getGuaGong,
  getGuaGongWuXin,
  getWuXingIndex,
  getFuYao
}
